# Aula 02 - Construção de Series e DataFrames

## **Resumo**: Exerícios de construção de Series e DataFrames para o curso de Ciência de Dados e Sociedade, a partir de dados fictícios de uma folha de pagamentos com cinco indivíduos

# I CARREGAMENTO DOS PACOTES NECESSÁRIOS

In [1]:
import pandas as pd
import numpy as np

# Exerício 1: Construção de Series

In [2]:
# a)
cpf      = ["81685817769", "28467813890", "34233677503", "33177188548", 
            "01855987228"]
nome     = np.array(["ALAN", "ANDERSON", "BEATRIZ", "JESSICA", "JOAO"])   
encargos = {0: 770, 1: 638, 2: 455, 3: 784, 4: 682}


cpf      = pd.Series(cpf, name = "CPF", dtype = "str")
nome     = pd.Series(nome, name = "Nome", dtype = "str")
encargos = pd.Series(encargos, name = "Encargos", dtype = "float")
salario  = pd.Series([4066, 7138, 4491, 3858, 11911], 
                     name = "Salário",
                     dtype = "int")

salario

0     4066
1     7138
2     4491
3     3858
4    11911
Name: Salário, dtype: int32

In [3]:
# b)
salario_anual = salario * 12
custo_mensal  = salario + encargos

salario_anual

0     48792
1     85656
2     53892
3     46296
4    142932
Name: Salário, dtype: int32

In [4]:
# c)
salario.describe()

count        5.00000
mean      6292.80000
std       3406.31424
min       3858.00000
25%       4066.00000
50%       4491.00000
75%       7138.00000
max      11911.00000
Name: Salário, dtype: float64

In [5]:
# d)
custo_mensal.describe()

count        5.000000
mean      6958.600000
std       3403.572799
min       4642.000000
25%       4836.000000
50%       4946.000000
75%       7776.000000
max      12593.000000
dtype: float64

# Exercício 2: Construção de DataFrames

In [6]:
# a)
folha = pd.DataFrame({"nome": nome,
                      "cpf": cpf,
                      "salario": salario,
                      "encargos": encargos,
                      "salario_anual": salario_anual,
                      "custo_mensal": custo_mensal,
                      "custo_anual": custo_mensal * 12
                      })
folha

,nome,cpf,salario,encargos,salario_anual,custo_mensal,custo_anual
0,ALAN,81685817769,4066,770.0,48792,4836.0,58032.0
1,ANDERSON,28467813890,7138,638.0,85656,7776.0,93312.0
2,BEATRIZ,34233677503,4491,455.0,53892,4946.0,59352.0
3,JESSICA,33177188548,3858,784.0,46296,4642.0,55704.0
4,JOAO,01855987228,11911,682.0,142932,12593.0,151116.0

In [7]:
# b)

folha.shape

(5, 7)

In [8]:
# c)

folha.size

35

In [9]:
# d)

folha.describe(include = "all")

,nome,cpf,salario,encargos,salario_anual,custo_mensal,custo_anual
count,5,5,5.00000,5.00000,5.000000,5.000000,5.000000
unique,5,5,NaN,NaN,NaN,NaN,NaN
top,ALAN,81685817769,NaN,NaN,NaN,NaN,NaN
freq,1,1,NaN,NaN,NaN,NaN,NaN
mean,NaN,NaN,6292.80000,665.80000,75513.600000,6958.600000,83503.200000
std,NaN,NaN,3406.31424,132.57149,40875.770877,3403.572799,40842.873591
min,NaN,NaN,3858.00000,455.00000,46296.000000,4642.000000,55704.000000
25%,NaN,NaN,4066.00000,638.00000,48792.000000,4836.000000,58032.000000
50%,NaN,NaN,4491.00000,682.00000,53892.000000,4946.000000,59352.000000
75%,NaN,NaN,7138.00000,770.00000,85656.000000,7776.000000,93312.000000
max,NaN,NaN,11911.00000,784.00000,142932.000000,12593.000000,151116.000000

# Exercício 3: Subconjuntos de DataFrames

In [10]:
# a)
# folha[ ["nome", "salario", "encargos"]]
# folha.loc[:,  "nome":"encargos"]
folha.iloc[:,  0:3]

       nome          cpf  salario
0      ALAN  81685817769     4066
1  ANDERSON  28467813890     7138
2   BEATRIZ  34233677503     4491
3   JESSICA  33177188548     3858
4      JOAO  01855987228    11911

In [11]:
# b)
folha.iloc[0:3, :]
# folha.loc["0":"2", :]

,nome,cpf,salario,encargos,salario_anual,custo_mensal,custo_anual
0,ALAN,81685817769,4066,770.0,48792,4836.0,58032.0
1,ANDERSON,28467813890,7138,638.0,85656,7776.0,93312.0
2,BEATRIZ,34233677503,4491,455.0,53892,4946.0,59352.0

In [12]:
# c)
folha[folha.salario > 6000]
# folha[folha["salario"] > 6000]

,nome,cpf,salario,encargos,salario_anual,custo_mensal,custo_anual
1,ANDERSON,28467813890,7138,638.0,85656,7776.0,93312.0
4,JOAO,01855987228,11911,682.0,142932,12593.0,151116.0

In [13]:
# d) 
folha[["nome", "salario", "encargos", "custo_anual"]][folha["salario"] > 4200]

       nome  salario  encargos  custo_anual
1  ANDERSON     7138     638.0      93312.0
2   BEATRIZ     4491     455.0      59352.0
4      JOAO    11911     682.0     151116.0